# read design
read_verilog phy_tx_cond.v
	   
# elaborate design hierarchy 	   
hierarchy -check -top phy_tx_cond
 	   
# the high-level stuff  	   
proc; opt; fsm; opt; memory; opt
 	   
# mapping to internal cell library 	   
techmap; opt
	   
# mapping flip-flops to cmos.lib	   
dfflibmap -liberty cmos.lib
	   
# mapping logic to cmos.lib	   
abc -liberty cmos.lib
	   
# cleanup	   
clean
	   
# write synthesized design  	   
write_verilog phy_tx_estr.v
